# Эта программа сравнивает дыв одинаковых значения.
# Получить от пользователя пароль.
password = input('Введите пароль: ')

# Определить, был ли введен правильный
# пароль.
if password == 'prospero':
    print('Пароль принят')
else:
    print('Извините, этот параль неверный.')
